Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType
Defines all types of abbreviation tags for Area and Path Reinforcement objects.
Since:
2016

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.PathReinforcementAlternatingBarOffset
Path Reinforcement - alternating bar offset.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.PathReinforcementAlternating
Path Reinforcement - alternating.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.PathReinforcementExterior
Path Reinforcement - wall exterior.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.PathReinforcementInterior
Path Reinforcement - wall interior.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.PathReinforcementBottom
Path Reinforcement - slab bottom.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.PathReinforcementTop
Path Reinforcement - slab top.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementLayerEachFace
Area Reinforcement - layer for each face

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementLayerEachWay
Area Reinforcement - layer for each way

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementExteriorMinor
Area Reinforcement - wall exterior for minor direction.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementExteriorMajor
Area Reinforcement - wall exterior for major direction.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementInteriorMinor
Area Reinforcement - wall interior for minor direction.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementInteriorMajor
Area Reinforcement - wall interior for major direction.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementBottomMinor
Area Reinforcement - slab bottom for minor direction.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementBottomMajor
Area Reinforcement - slab bottom for major direction.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementTopMinor
Area Reinforcement - slab top for minor direction.

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType.AreaReinforcementTopMajor
Area Reinforcement - slab top for major direction.